/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dpotvin <dpotvin@student.42quebec.com>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/02/10 09:55:38 by dpotvin           #+#    #+#             */
/*   Updated: 2023/02/23 04:28:06 by dpotvin          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "client.h"

t_data	*get_data(void)
{
	static t_data	t;

	return (&t);
}

int	main(int argv, char **argc)
{
	int	i;

	if (argv != 3 || !is_numeric(argc[1]))
		return (errormsg());
	get_data()->server_id = ft_atoi(argc[1]);
	i = 0;
	while (argc[2][i])
		char_to_binary(argc[2][i++]);
	char_to_binary('\0');
	return (0);
}
// Bunch of emojis to test
/*
👋🌎🌞🌻🍔🎉🎓💰🎁🎄🎃🐶🐱🦁🐵🐻🦊🐯🐮🐷🦄🐙🐬🐠🦐🍕🍩🍺🍸🍹🚀🚲🚁🚗🚊🏰🗽💻📱🎧🎬🎨🏀
⚽️🎲🎮🎤🎹🎸🚣‍♀️🚴‍♀️🏊‍♂️🏋️‍♂️🚶‍♂️🏃‍♀️🎭🎬🎥🎫🎟️🎭🎯🎳🎰🎳🎿🎾🎱🎲🎮🃏🀄️🎴🎭🎫🎟️🎙️🎚️🎛️🕰️🕯️🛍️💄👠👒👑
👓👜👛🧢🧣👔👕👖🧥👗👘👙👚👞👟🥾🥿👡🩰🥼🦺🧤🧦🧥👙🧢🎓🎩🧢🎓🎒👝💼👜👛🎁🎀🎊🎉🎈🎂🍰🧁
🍭🍬🍫🍩🍪🍕🍔🍟🌭🌮🌯🍲🍛🍜🍝🍠🥔🥕🥦🍆🍅🥒🌶️🥑🥬🥝🍓🍇🍉🍊🍌🍍🥭🥥🥜🌰🍯🍞🧀🥐🥖🥨🥯
🍳🍔🍕🍟🍗🥩🥓🍖🌭🍞🥪🥙🥚🥞🧇🥓🍟🥤🍹🍺🍷🍾🥂🍸🥃🍻🥛🍼🥤🧃🧉🥢🍽️🍴🥄🏺🎁🎂🎊🎉🎈🎆🎇
🎃🎄🎅🎁🎍🎑🎏🎉🎈🎁🎂🎊🎃🎄🎇🎆🎁🎉🎋🎎🎏🎐🎑🎌🏮
*/
